9/data/attachments/7b98c8a2f76e2ff1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ab958f1b-5b02-4dd2-8fc6-421991f2fb8a</nif:username>
            <nif:friendToBeAdded>Ashley_most_Friend_54638_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>